Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [1]:
import pandas as pd

In [2]:
ratings = pd.read_csv('ratings.csv')
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [3]:
ratings_filtered_5 = ratings[ ratings['rating'] == 5 ]
ratings_filtered_5.head()

   userId  movieId  rating  timestamp
3       1       47     5.0  964983815
4       1       50     5.0  964982931
6       1      101     5.0  964980868
8       1      151     5.0  964984041
9       1      157     5.0  964984100

In [4]:
ratings_filtered_5.groupby('movieId').count().head(1)

         userId  rating  timestamp
movieId
1            47      47         47

Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [5]:
power = pd.read_csv('power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [8]:
power_pribaltika = power[ (power['country'] == 'Lithuania') | (power['country'] == 'Latvia') | (power['country'] == 'Estonia')]
power_pribaltika['country'].unique()

array(['Lithuania', 'Latvia', 'Estonia'], dtype=object)

In [10]:
power_year = power_pribaltika[ (power_pribaltika['year'] <= 2010) & (power_pribaltika['year'] >= 2005) ]
power_year['year'].unique()

array([2010, 2009, 2008, 2007, 2006, 2005], dtype=int64)

In [18]:
power_category = power_year[ (power_year['category'] == 4) | (power_year['category'] == 12) | (power_year['category'] == 21) ]
power_category['category'].unique()

array([ 4, 12, 21], dtype=int64)

In [27]:
power_category.groupby('category').sum().query('quantity > 0').reset_index()[['category','quantity']]

   category  quantity
0         4      46.0
1        12    6227.0
2        21  234208.0

Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.

In [41]:
df = pd.read_html('http://www.finmarket.ru/currency/rates/')
df[1:]

[    Код                     Валюта  Кол-во     Курс Изменение
 0   AUD       Австралийский доллар       1   567684   +0,3982
 1   AZN      Азербайджанский манат       1   470869    -03380
 2   AMD             Армянский драм     100   162257    -01297
 3   BYN          Белорусский рубль       1   301855    -01172
 4   BGN             Болгарский лев       1   478101    -01055
 5   BRL           Бразильский реал       1   139301    -01003
 6   HUF          Венгерский форинт     100   255801   +0,0150
 7   KRW      Вона Республики Корея   1 000   705466    -04232
 8   HKD         Гонконгский доллар       1   103219    -00699
 9   DKK              Датская крона       1   125558    -00295
 10  USD                 Доллар США       1   800006    -05743
 11  EUR                       ЕВРО       1   933447    -04123
 12  INR            Индийская рупия      10   107538    -00714
 13  KZT        Казахстанский тенге     100   184591    -00301
 14  CAD           Канадский доллар       1   606571   +0,2652
 15  KGS             Киргизский сом     100   977677    -07019
 16  CNY  Китайский юань Жэньминьби       1   119623    -00636
 17  MDL             Молдавский лей      10   466476    -04998
 18  TMT    Новый туркменский манат       1     2289    -01643
 19  NOK           Норвежская крона      10   842928   +0,1942
 20  PLN            Польский злотый       1     2033   +0,0064
 21  RON              Румынский лей       1    19212    -00532
 22  XDR    СДР (спец. прав заим-я)       1  1127784    -09644
 23  SGD        Сингапурский доллар       1   587203    -02053
 24  TJS          Таджикский сомони      10     7752    -03490
 25  TRY              Турецкая лира      10   945868    -12923
 26  UZS              Узбекский сум  10 000   771696    -05979
 27  UAH          Украинская гривна      10   279451    -02898
 28  GBP            Фунт стерлингов       1  1037208   +0,0128
 29  CZK              Чешская крона      10    34562   +0,1812
 30  SEK             Шведская крона      10   901009    -01720
 31  CHF          Швейцарский франк       1   872607    -05115
 32  ZAR       Южноафриканский рэнд      10   497482   +0,3285
 33  JPY              Японская йена     100   764861    -03141]